cask_args appdir: '/Applications'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'

# brews
brew 'bat'
brew 'bash-completion'
brew 'git'
brew 'hub'
brew 'gnupg2'
brew 'mmv'
brew 'postgresql', restart_service: true
brew 'reattach-to-user-namespace'
brew 'stow'
brew 'tmux'
brew 'unixodbc'
brew 'wrk'


# TODO - determine way to install 'asdf' version manager
brew 'coreutils'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'

# casks
cask 'atom'
cask 'brave-browser'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'fantastical'
cask 'font-saucecodepro-nerd-font'
# cask 'font-source-code-pro-for-powerline'
cask 'gimp'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'mailspring'
cask 'postman'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'telegram'
cask 'visual-studio-code'
cask 'zsa-wally' #ergodox-ex keyboard flashing tool

# mac app store installs
mas 'todoist-to-do-list-tasks', id: 585829637
